# أولاً عملت عنوان المشروع
print("ﺔﻳﺮﺴﻟﺍ ﺔﻓﺮﻐﻟﺍ ﻰﻠﻋ ﺭﻮﺜﻌﻟﺍ ﻚﻴﻠﻋ ❓❓❓","\n----------------------------")
def center():
    print("-------------------------","\n ﻂﺳﻮﺘﻤﻟﺍ ﻯﻮﺘﺴﻤﻟﺍ ﻲﻓ ﻥﻷﺍ ﺖﻧﺃ","----------------------------")
def stert_3():
    print("--------------------------","\nﺲﻜﻌﻟﺍ ﺔﻓﺮﻏ ﻲﻓ ﻥﻻﺍ ﺖﻧﺃ 🚶‍♂️","\n----------------------------------")
    USER_STERT_3 = input(" 2 ﻢﻗﺭ ﺏﺎﺒﻟﺍ ﺮﺘﺧﺃ ﺏﺍﻮﺑﺃ ﻊﺑﺭﺃ ﻚﻌﻧ ")
    if USER_STERT_3 == "-2":
        center()
    else:
        print(" ﻂﻠﻐﻟﺍ ﺏﺎﺒﻟﺍ ﺕﺮﺘﺧﺃ ﺪﻘﻟ ❌❌❌")

def stert_2():
    print("--------------------------","\nﺲﺳﺍ ﺔﻓﺮﻏ ﻲﻓ ﻥﻷﺍ ﺖﻧﺃ 🚶","\n------------------------")
    USER_STERT_2 = input(" 3 ﻢﻗﺭ ﺏﺎﺒﻟﺍ ﺮﺘﺧﺍ 22🧧 🧧1 🧧3 🧧11 ﺏﺍﻮﺑﺍ ﻊﺑﺭﺍ ﻚﻌﻣ ")
    if USER_STERT_2 == '27':
        stert_3()
    else:
        print(" ﻂﻠﻐﻟﺍ ﺏﺎﺒﻟﺍ ﺕﺮﺘﺧﺃ ﺪﻘﻟ ❌❌❌")
    
def stert_1():
    print("---------------------------","\nﻝﺎﺒﻘﺘﺳﻷﺍ ﺔﻟﺎﺻ ﻲﻓ ﻥﻷﺍ ﺖﻧﺃ 🚶","\n--------------------------")
    USER_STERT_1 = input(" (1) ﺏﺎﺒﻟﺍ ﺮﺘﺧﺃ a b c d ﺏﺍﻮﺑﺃ ﻊﺑﺭﺃ ﻚﻌﻣ  ").lower()
    if USER_STERT_1 == "a":
        stert_2()
    else:
        print(" ﻂﻠﻐﻟﺍ ﺏﺎﺒﻟﺍ ﺕﺮﺘﺧﺃ ﺪﻘﻟ ❌❌❌")
def stert():
    USER_STERT = input("ﻝﻮﺧﺪﻟ Enter ﻂﻐﺿﺍ ﺔﻳﺍﺪﺒﻟﺍ ﻲﻓ ﻥﻷﺍ ﺖﻧﺃ")
    stert_1()
stert()