#اولاً عملت عنوان المشروع
print("ﺕﺍﺭﺎﺼﺘﺧﻷﺍ ﺀﺎﺸﻧﺃ ﺞﻣﺎﻧﺮﺑ 🤗🤗🤗",'\n--------------------------')
#ثانياً عملت متغير يتخزن فيه المدخلات وإذا كتب المستخدم (,) يعمل حاجز بين الاسم الاول الاسم الثاني
NAMES = input("ﺀﺎﻤﺳﻷﺍ ﻞﺼﻔﻟ ﺎﻣﻮﻛ ﻂﺣﻭ ﺐﻘﻠﻟﺍﻭ ﻢﺳﻷﺍ ﻦﻴﺑ ﺔﻓﺎﺴﻣ ﻂﺣ ﻦﻜﻟﻭ ﻚﺋﺎﻗﺪﺻﺍ ﺀﺎﻤﺳﺍ ﺐﺘﻛﺍ  ").split(",")

#ثالثاً عملت القوائم
list_NAME = []
#ثالثاً عملت مكينة التكرارا
for x in NAMES:
#بعدها عملت متغير اذا عمل المستخدم مسافة يعمل حاجز وهذه استعملت علشان يعمل حاجز بين الاسم واسم العائلة
    NAMES_ = x.split()
#وبعدها طبعت المتغير 
    print(NAMES_)
#وبعدها عملت متغيرين ثنين الأول الاسم والثاني اسم الوالد
    A_NAME = NAMES_[0]
    I_NAME = NAMES_[1]
#وبعدها عملت متغيرين ثنين الاول هوا الحرف الاول من الأسم والثاني هو الحرف الأول من اسم الوالد
    AA_NAME = A_NAME[0]
    II_NAME = I_NAME[0]
    koki = AA_NAME.upper() + '.' + II_NAME.upper() + "."
    list_NAME.append(koki)
for j in list_NAME:
    print(j)