#ولاً عملت عنوان البرنامج
print("Project Transfer bunny to herb:🐇 ,🌿")
print("------------------------------")
#!ثانياً عملت القائمة الخاصة بالعشب 
list_herb = [['🌿','🌿','🌿'],['🌿','🌿','🌿'],['🌿','🌿','🌿']]
#*ثالثاً عملت امر الطباعة للعشب
print("--------------------------------")
print(f"{list_herb[0]}  \n{list_herb[1]}  \n{list_herb[2]}")
print("--------------------------------")
#*ثالثاً عملت متغير للمستخدم
user = (input("Where  do you want transfer bunny ?  "))
#*رابعاً عملت التحولات 
user_1 = int(user[0])
user_2 = int(user[1])
#*في العمود والرفع الذي يختاره المستخدم من عشب الى أرنب list_herb خامساً حولت المتغير 
list_herb[user_1 -1][user_2 -1]  =  "🐇"
#*وأخيراً طبع قائمة العشب مرة ثاني
print("--------------------------------")
print(f"{list_herb[0]}  \n{list_herb[1]}  \n{list_herb[2]}")
print("--------------------------------")